import time

start_time = time.time()

array = [3,5,1,2,4]
summary = 0 

for x in array:
    summary += x

print(summary)


# n개의 데이터 만큼 합을 구하는 것을 수행하기 때문에
# 수행 시간은 데이터의 개수 M에 비례하다.
# 시간 복잡도: O(N)


for i in array:
    for j in array:
        temp = i*j
        print(temp)

# 시간 복잡도: O(N^2) 
# n이 커지는 만큼 연산이 n^2만큼 비례한다.
# 그렇지만 이중for문이 다 n^2만큼 시간복잡도가 아니다
# 안의 함수에 의해 시간 복잡도가 늘어날 수도 있기 때문에



#######
## 알고리즘 설계 Tip
## cpu 기반의 개인 컴퓨터 or 채점용 컴퓨터에서 연산 횟수가 5억을 넘어가는 경우//
## python을 기준으로 통상 5~15초 가량의 시간이 소요
## PyPy를 지원하면 c언어보다 가끔 빠르게 동작하기도 함.(보장x)
## py가 시간제한에 걸리면 pypy로 확장명 바꾸는 것도 팁!!

## 테스트에서 시간 제한은 통상 1~5초 가량이라는 점..

## 문제에서 가장 먼저 확인해야하는 내용은 시간제한(수행시간 요구사항)
#
#
# 
## 일반적인 알고리즘 문제 해결 과정

### 지문 읽기 및 컴퓨터적 사고
### 요구사항(복잡도) 분석
### 문제 해결을 위한 아이디어 찾기
### 소스코드 설계 및 코딩

#######


print('time: ', time.time() - start_time)