# 정수형
a =100
print(a)

# 실수형

a1 = 5.1 

b1 = 5.  # 소수부가 0일 때 0을 생략 가능
b2 = -.7 # 정수부가 0일 때 0을 생략

print(a + a1) # 정수와 소수 연산 가능

## 파이썬에서는 e나 E를 이용한 지수 표현 방식을 이용할 수 있다.

# 예를 들어, 1e9라고 입력 하면 , 10의 9제곱이 된다.
# 지수 현 방식은 임의의 큰 수를 표현하기 위해 자주 사용
# 최단 경로 알고리즘에서는 도달할 수 없는 노드에 대하여 최단거리를 무한(INF)로 설정하곤 한다.

c = 75.25e1 # 752.5


# 컴퓨터 시스템은 2진수를 사용하기 때문에 정확한 실수 연산이 불가하다.
# 이러한 표현 상의 문제를 해결하기 위해서, round()함수를 이용할 수 있다
d = round(123.456,2) # 소수점 아래 셋째 자리에서 반올림하여, 둘째 자리까지 정확히 출력
print(d)

# 출력 시, 자리 수 지정해주기 %
print('%.11f' %(round(float(input()),11)))

# 10진수 -> 2,10,16진수로 출력하는 법 bin, oct, hex 내장함수 이용 가능(문자열 형태로 출력)
print(format(int(input()), 'b'))
print(format(int(input()), 'o'))
print(format(int(input()), 'x'))



### 파이썬에서의 수학 라입브러리가 필요없는 연산자 라이브러리

## 파이썬에서 나누기 연산자(/)는 나눠진 결과를 실수형으로 반환한다.
## 파이썬에서 몫을 얻기 위해서는 몫 연산자(//)를 사용한다.

k =5
x = 3

print(k/x)
print(k%x)
print(k//x)

a,b = input().split()

print(b,a)