# 리스트 or 문자형

# 여러 개의 데이터를 연속적으로 담아 처리하기 위해 사용하는 자료형

# 리스트 초기화 대괄호 안에 원소를 넣어 초기화, 쉼표로 원소 구분
# 비어 있는 리스트 선언 시에는 [] 또는 list()


# 크기가 n이고, 모든 값이 0인 1차원 리스트 초기화
a = []
n =10
a = [0]*n

print(a)

b = [1,2,3,4,5,6,7,8,9]

# 뒤에서 첫 번째 원소 출력
print(b[-1])

# 뒤에서 세 번째 원소 출력
print(b[-3])

# 일곱 번째 원소 출력
print(b[7])

# 파이썬은 슬라이싱을 제공: 연속적인 위치를 갖는 원소들을 가져온다.
# :을 대괄호 안에 넣어서 시작 인덱스, 끝 인덱스 설정

# 두 번째 원소부터 네 번째 원소까지
print(b[1:4])


# 리스트 컴프리헨션: 리스트를 초기화 하는 방법 중 하나
# 대괄호 안에 조건, 반복을 적용하여 리스트를 초기화

# 0부터 9까지의 수를 포함하는 리스트
# for문으로 뺀 i를 그 i 값을 설정하겠다.
# 설정할 때 반복문 먼저 적어준다.
# 그 원소들을 리스트 원소로써 담는다.

array = [i for i in range(10)]

print(array)

# 0부터 19까지의 수 중에서 홀수만 포함하는 리스트
array = [i for i in range(20) if i %2 == 1]
print(array)

# 1부터 9까지의 수들의 제곱 값을 포함하는 리스트
array = [i*i for i in range(1,10)]
print(array)




# 특히 리스트 컴프리헨션은 2차원 리스트를 초기화 할때 효과적으로 사용가능

# 특히, NxM 크기의 2차원 리스트를 한번에 초기화 해야 할때 매우 유용
n = 4
m = 3

# 파이썬에서 반복을 수행하되 반복을 위한 변수의 값을 무시하고자 할 때 _ 사용
array = [[0]*m for _ in range(n)]
print(array)

# 이런 식으로 하면 내부적인 리스트가 모두 같은 객체로써 리스트 인식
# 리스트 변수 주소이기 때문



# 리스트 관련 기타 메소드
# append(): 원소를 하나 삽입 : O(1)
# sort() : 오름차순, 내림차순 : O(NlogN)
# reverse(): 리스트의 원소 순서 모두 뒤집음
# insert(): 특정한 인덱스 위치에 원소 삽입
# count(): 리스트에서 특정한 값을 가지는 데이터 개수 셀 때 사용
# remove(): 특정한 값을 갖는 원소 제거, 값을 가진 원소 여러개면 하나만 제거


_list = [4,3,3,3,3,2,1]

_list.reverse()
print('원소 뒤집기: ', _list)

_list.insert(2,3)
print('인덱스 2에 3추가: ', _list)

_list.count(3)
print('값이 3인 데이터 개수: ', _list)

_list.remove(1)
print('값이 1인 데이터 삭제: ', _list)


# 특정 값을 가지는 원소 모두 제거하고 싶을 때 -> 집합 자료형
remove_set = {3,5}

result = [i for i in _list if i not in remove_set]
print('집합 자료형을 이용한 특정 값 원소 모두 제거: ',result)