# String 문자열을 ''로 묶으면 " 출력 가능

data = 'Hello World'
print(data)

data = "Don't you know \"Python\""
print(data)

# 문잦열 연산 가능 + 이용하면 문자열 더해져서 연결
# 곱하는 경우 문자열이 그만큼 더해짐

a = 'Hello'
b = 'World'

print(a + " " + b)

print(a*3)

# a[2] = 'a' 문자열에서는 특정 문자 변경 불가능한 객체

# 문자열 대문자 변경
a =format(int(input()), 'x')

print(str(a).upper())

# 튜플
# ==> 문자열과 같이 한 번 선언된 값을 변경할 수 없다.
# 리스트는 대괄호를 사용하지만, 튜플은 소괄호 사용
# 리스트 보다 적은 양의 메모리 사용

# 튜플 사용하는 경우: 서로 다른 성질의 데이터를 묶어서 관리해야 할 때
# 최단 경로 알고리즘에서는 (비용, 노드번호)의 형태로 튜플 자료형 자주 사용
# 학생 정보(학번, 성적) 이러한 경우

# 해싱의 티 값으로 데이터의 묶음, 나열을 사용 해야 할 때
# 리스트는 변경 가능하기 때문에 키 값으로 사용 x, 튜플은 변경 할 수 없기 때문에 키 값 사용 o

a =(1,2,3,4,5,6,7,8,9)

print(a[3])
print(a[1:4])

# a[2] = 7  불가

