##################
# 리스트나 튜플은 순서가 있기 때문에, 인덱싱을 통해 자료형의 값을 얻을 수 있다.
# 사전 자료형과 집합 자료형은 순서가 없기 때문에, 인덱싱으로 값을 얻을 수 없다.
# 사전 자료형은 키값, 집합 자료형은 원소를 이용해 값을 조회 하기 때문에, 상수시간(O(1))의 시간 복잡도로 조회한다.
##################

# 사전 자료형
# 키와 값의 쌍을 데이터로 가지는 자료형
# 변경 불가능한 자료형을 키로 사용 가능

# 대괄호를 이용하여 키 값 선언, 값을 넣어줘서 키에 맞는 값 매핑
data = dict()
data['사과'] = 'Apple'
data['바나나'] = 'Banana'
data['코코넛'] = 'Coconut'

print(data)

if '사과' in data:
    print('\'사과\'라는 키가 존재합니다.')


# 키 데이터만 뽑아서 리스트로 이용 ==> keys() 함수 이용
# 값 데이터만 뽑아서 리스트로 이용 ==> values() 함수 이용

key_list = data.keys()

val_list = data.values()

print(key_list)
print(val_list)

for i in key_list:
    print(i, data[i])


b = {
    '홍길동': 97,
    '이순신': 98
}
print(b)

key_list_b = list(b.keys()) # keys함수를 그냥 사용하면 사전 키라는 하나의 객체로써 반환되기 때문에 list 함수를 이용하여 형 변환 수행
print(key_list_b)


############################################

# 집합 자료형
# set() 함수 이용
# 리스트 혹은 문자열을 이용해서 초기화 가능
# 또는, 중괄호 안에 각 원소를 ,로 구분하여 삽입함으로써 초기화 가능.
# 데이터의 조회 및 수정에 있어서 상수시간(O(1))을 처리할 수 있다는 점에서 사전 자료형과 동일
# 중복 허용 x, 순서가 없다

# 방법1. 리스트를 이용한 초기화
data = set([1,2,3,4,4,5,5,6]) # 리스트를 이용 => 중복은 제거됨
print(data)

# 방법2. {}내부에서 콤마를 기준으로 초기화
data = {1,2,3,4,5,6,6} 
print(data)

for i in data:
    print(i)
# 집합 자료형은 합집합, 교집합, 차집합 연산 등이 가능하다.
# |: 합집합, &: 교집합, -: 차집합

# 새로운 원소 추가
data.add(7)
print(data)
# 새로운 원소 여러개 추가
data.update([8,9])
print(data)
# 특정한 값을 갖는 원소 제거
data.remove(1)
print(data)